#+name: pre
#+BEGIN_SRC python :results file :var fname="fig/total.png" :exports both
  import pandas as pd
  import matplotlib.pyplot as plt
  import statsmodels.formula.api as sm

  plt.style.use('ggplot')


  totals = pd.read_csv('data/whelk_correlation_table.csv')
  g = sns.lmplot('whelks', 'barnacles', totals)
  ax = plt.gca()
  ax.figure.savefig(fname)

  return fname
#+END_SRC

#+RESULTS: pre
[[file:]]

#+BEGIN_SRC python :results output
  import pandas as pd
  import matplotlib.pyplot as plt
  import statsmodels.formula.api as sm
  import seaborn as sns

  plt.style.use('ggplot')


  totals = pd.read_csv('data/whelk_correlation_table.csv')
  print(sm.ols(formula="whelks ~ barnacles", data=totals).fit().summary())

#+END_SRC

#+RESULTS:
#+begin_example
                            OLS Regression Results                            
==============================================================================
Dep. Variable:                 whelks   R-squared:                       0.916
Model:                            OLS   Adj. R-squared:                  0.909
Method:                 Least Squares   F-statistic:                     120.3
Date:                Tue, 26 Sep 2017   Prob (F-statistic):           2.91e-07
Time:                        19:56:03   Log-Likelihood:                -26.216
No. Observations:                  13   AIC:                             56.43
Df Residuals:                      11   BIC:                             57.56
Df Model:                           1                                         
Covariance Type:            nonrobust                                         
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept      2.4045      0.656      3.665      0.004       0.960       3.849
barnacles      0.0352      0.003     10.970      0.000       0.028       0.042
==============================================================================
Omnibus:                        9.535   Durbin-Watson:                   2.161
Prob(Omnibus):                  0.009   Jarque-Bera (JB):                5.159
Skew:                           1.261   Prob(JB):                       0.0758
Kurtosis:                       4.778   Cond. No.                         245.
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
#+end_example
